In [46]:
import pandas as pd

# Series

In [47]:
data = [1,2,3,4,5]

In [48]:
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [49]:
index=['linha' + str(i) for i in range(5)]
index

['linha0', 'linha1', 'linha2', 'linha3', 'linha4']

In [50]:
s = pd.Series(data, index)
s

linha0    1
linha1    2
linha2    3
linha3    4
linha4    5
dtype: int64

In [51]:
data = {
    'linha' + str(i) : i + 1 for i in range(5)
}
data

{'linha0': 1, 'linha1': 2, 'linha2': 3, 'linha3': 4, 'linha4': 5}

In [52]:
s = pd.Series(data)
s

linha0    1
linha1    2
linha2    3
linha3    4
linha4    5
dtype: int64

In [53]:
s1 = s + 2
s1

linha0    3
linha1    4
linha2    5
linha3    6
linha4    7
dtype: int64

In [54]:
s2 = s + s1
s2

linha0     4
linha1     6
linha2     8
linha3    10
linha4    12
dtype: int64

# DataFrame

In [55]:
data = [[1,2,3], 
        [4,5,6], 
        [7,8,9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [56]:
df1 = pd.DataFrame(data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [57]:
index = ['linha' + str(i) for i in range(3)]
index

['linha0', 'linha1', 'linha2']

In [58]:
df1 = pd.DataFrame(data = data, index = index)
df1

        0  1  2
linha0  1  2  3
linha1  4  5  6
linha2  7  8  9

In [59]:
columns = ['colunas' + str(i) for i in range(3)]
columns

['colunas0', 'colunas1', 'colunas2']

In [60]:
df1 = pd.DataFrame(data, index, columns)
df1

        colunas0  colunas1  colunas2
linha0         1         2         3
linha1         4         5         6
linha2         7         8         9

In [61]:
data = {'coluna0': {'linha0': 1, 'linha1': 4, 'linha2': 7},
        'coluna1': {'linha0': 2, 'linha1': 5, 'linha2': 8},
        'coluna2': {'linha0': 3, 'linha1': 6, 'linha2': 9}}
data

{'coluna0': {'linha0': 1, 'linha1': 4, 'linha2': 7},
 'coluna1': {'linha0': 2, 'linha1': 5, 'linha2': 8},
 'coluna2': {'linha0': 3, 'linha1': 6, 'linha2': 9}}

In [62]:
df2 = pd.DataFrame(data)
df2

        coluna0  coluna1  coluna2
linha0        1        2        3
linha1        4        5        6
linha2        7        8        9

In [63]:
data = [(1,2,3), 
        (4,5,6), 
        (7,8,9)]
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [64]:
df3 = pd.DataFrame(data, index, columns)
df3

        colunas0  colunas1  colunas2
linha0         1         2         3
linha1         4         5         6
linha2         7         8         9

In [65]:
df1[df1 > 0] = 'A'
df1

       colunas0 colunas1 colunas2
linha0        A        A        A
linha1        A        A        A
linha2        A        A        A

In [66]:
df2[df2 > 0] = 'B'
df2

       coluna0 coluna1 coluna2
linha0       B       B       B
linha1       B       B       B
linha2       B       B       B

In [67]:
df3[df3 > 0] = 'A'
df3

       colunas0 colunas1 colunas2
linha0        A        A        A
linha1        A        A        A
linha2        A        A        A

In [68]:
df4 = pd.concat([df1, df2, df3])
df4

       coluna0 coluna1 coluna2 colunas0 colunas1 colunas2
linha0     NaN     NaN     NaN        A        A        A
linha1     NaN     NaN     NaN        A        A        A
linha2     NaN     NaN     NaN        A        A        A
linha0       B       B       B      NaN      NaN      NaN
linha1       B       B       B      NaN      NaN      NaN
linha2       B       B       B      NaN      NaN      NaN
linha0     NaN     NaN     NaN        A        A        A
linha1     NaN     NaN     NaN        A        A        A
linha2     NaN     NaN     NaN        A        A        A

In [69]:
df4 = pd.concat([df1, df2, df3], axis=1)
df4

,colunas0,colunas1,colunas2,coluna0,coluna1,coluna2,colunas0,colunas1,colunas2
linha0,A,A,A,B,B,B,A,A,A
linha1,A,A,A,B,B,B,A,A,A
linha2,A,A,A,B,B,B,A,A,A

In [71]:
dados = {'A': {'X': 1, 'Y': 3}, 'B': {'X': 2, 'Y': 4}}
df = pd.DataFrame(dados)
df

   A  B
X  1  2
Y  3  4